#+TITLE: The Explicit-Control Evaluator
#+AUTHOR: Fabricio Puente Mansilla
#+DATE: <2026-05-30 Sat>
#+OPTIONS: toc:2
#+PROPERTY: header-args:elisp :results output :exports both

* Elisp Demonstration: Abstracting the Machine State
While we cannot physically wire a CPU in Emacs, we can visualize the
register state of our evaluator as a simple association list (a hash
table/struct equivalent).

#+BEGIN_SRC elisp
  ;; A structural representation of the Evaluator Machine's Registers
  (defvar evaluator-machine
    '((EXP . nil)
      (ENV . global-env)
      (VAL . nil)
      (FUN . nil)
      (ARG . nil)
      (UNEV . nil)
      (CONTINUE . halt)))

  (defun set-register (reg value)
    "Updates the hardware register."
    (setf (cdr (assoc reg evaluator-machine)) value))

  (defun get-register (reg)
    "Reads the hardware register."
    (cdr (assoc reg evaluator-machine)))

  ;; Simulating the setup for evaluating (+ 2 3)
  (set-register 'EXP '(+ 2 3))
  (set-register 'ENV 'local-env)
  (set-register 'CONTINUE 'print-result)

  (princ (format "Machine State Loaded.\nExpression to compute: %s\nReturn Address: %s\n"
                 (get-register 'EXP)
                 (get-register 'CONTINUE)))
#+END_SRC

#+RESULTS:
: Machine State Loaded.
: Expression to compute: (+ 2 3)
: Return Address: print-result

* Elisp Demonstration: Simulating the Dispatch Router
We can simulate the concept of the hardware dispatcher and its
destructive nature using Elisp.

#+BEGIN_SRC elisp
  (defvar reg-EXP nil)
  (defvar reg-ENV 'global)
  (defvar reg-UNEV '(2 3))
  (defvar stack nil)

  (defun sim-eval-dispatch ()
    "Simulates the evaluator, which destroys registers!"
    (princ (format "  [eval-dispatch] Evaluating %s...\n" reg-EXP))
    ;; Simulating the destruction of registers during deep evaluation
    (setq reg-ENV 'clobbered-env)
    (setq reg-UNEV 'clobbered-unev)
    'operator-found)

  (defun sim-ev-application ()
    "Simulates setting up an application evaluation."
    (princ "Setting up operator evaluation...\n")

    ;; 1. Save state defensively before calling eval-dispatch
    (push reg-ENV stack)
    (push reg-UNEV stack)
    (princ "  Registers SAVED to stack.\n")

    ;; 2. Set up the operator in EXP
    (setq reg-EXP '+)

    ;; 3. Call the destructive eval-dispatch
    (sim-eval-dispatch)

    ;; 4. Restore state
    (setq reg-UNEV (pop stack))
    (setq reg-ENV (pop stack))
    (princ "  Registers RESTORED from stack.\n")

    (princ (format "Ready to evaluate operands: %s in %s\n" reg-UNEV reg-ENV)))

  (sim-ev-application)
#+END_SRC

#+RESULTS:
: Ready to evaluate operands: (2 3) in global

